<?php
session_start();
include("functions.inc.php");

if (validate_user($_SESSION['helpdesk_user_id'], $_SESSION['code'])) {
//if (validate_admin($_SESSION['helpdesk_user_id'])) {
    include("inc/head.inc.php");
    include("inc/navbar.inc.php");



    ?>
    <div class="container">
        <div class="page-header" style="margin-top: -15px;">
            <h3 ><center>Інструкція по роботі з системою заявок</center></h3>
        </div>


        <div class="row">
            <div class="col-md-12">
                <div class="panel ">
                    <div class="panel-body">
                        <center>
                            <img src="img/helpdesk.001.png" class="img-responsive img-thumbnail">
                        </center>
                    </div>
                </div>
            </div>
            <div class="col-md-offset-1 col-md-10">













                <ul class="nav nav-tabs">
                    <li class="active"><a href="#home" data-toggle="tab">1. Створення заявки</a></li>
                    <li><a href="#profile" data-toggle="tab">2. Перегляд заявки</a></li>
                    <li><a href="#messages" data-toggle="tab">3. Зміна інформації про працівника</a></li>

                </ul>

                <!-- Tab panes -->
                <div class="tab-content">
                    <div class="tab-pane active" id="home"><div class="panel panel-default">
                            
                            <div class="panel-body">

                                <img src="img/help1.png" class="img-responsive img-thumbnail"><br>
                                <p>Для створення заявки, Вам необхідно заповнити обов'язкові поля.
                                </p>
                                <ol>
                                    <li><strong>Від кого</strong> - Вам необхідно почати набирати частину прізвища, ім'я, по батькові або логін. Якщо такий працівник вже є в системі, то Вам автоматично буде запропоновано обрати його зі спіску. Якщо його немає - то він буде створено. В правій частині сторінки Ви можете додатково вказати контактну інформацію про працівника. Як правило це контактний телефон, адреса.</li>
                                    <li><strong>Кому</strong> - вказується відділ. Обов'язковим є вказати відділ, а також опціонально виконавця. Якщо вказати лише відділ, то заявку побачать всі працівники відділу. Якщо вказати ще й виконавця, то заявку побачить лише виконавець а також начальник його відділу.</li>
                                    <li><strong>Пріорітет</strong> - вказується пріорітет виконання заявки. В загальному списку заявки його можно побачити певними позначками.</li>
                                    <li><strong>Тема</strong> - вказується коротко тема заявки.</li>
                                    <li><strong>Повідомлення</strong> - вказується детально суть заявки.</li>
                                </ol>


                            </div>

                        </div></div>
                    <div class="tab-pane" id="profile"><div class="panel panel-default">
                            
                            <div class="panel-body">








                                <img src="img/help2.png" class="img-responsive img-thumbnail">
                                <br>
                                <p>Вам доступні три "каталоги": "Вхідні", "Вихідні", "Архів". Детально про них нижче.
                                </p>
                                <ul>
                                    <li><strong>Вхідні</strong> - в данному каталозі містяться всі заявки адресовані Вам безпосередньо або Вашому відділу.
                                        Якщо Ви маєте права користувача - то бачите лише заявки адресовані всьому відділу або Вам безпосередньо. (заявки адресовані Вам та відділу)
                                        Якщо Ви маєте права куратору відділа - то бачите всі заявки Вашого відділу (адресовані Вам, користувачам, та відділу)
                                    </li>
                                    <li><strong>Вихідні</strong> - в данному каталозі містяться всі заявки які створювали Ви. Ви можете переглядати статус Ваших створюваних заявок.
                                    </li>
                                    <li><strong>Архів</strong> - в данному каталозі містяться всі заявки які були виконані, та через певний час перейшли в архів. Вони потраплають в архів автоматично.
                                    </li>
                                </ul>
                                <p>
                                    У списку заявки мають різні кольори, для того, щоб бачити їх статус. Якщо заявка червого кольору - то вона не прочитана. Жовтого - блокована Вами. Сірого- блокована користувачем. Зеленого - виконана заявка.
                                </p>
                                <center>
                                <img src="img/help3.png" class="img-responsive">
                                </center>
                                <p>
                                    <strong>Як тільки Ви або Ваш відділ отримали нову заявку</strong>, Вам необхідно переглянути її, натиснувши на тему та прийняти рішення:
                                <ul>
                                    <li><strong>Переадресувати на інший відділ/або користувача</strong> - Якщо заявка не в Вашій компетенції, то ви можете перевести заявку на інший відділ або користувача.
                                    </li>
                                    <li><strong>Заблокувати її</strong> - для того щоб всі бачили, що Ви працюєте в данний час с заявкою, та інші користувачі не змогли нічого робити с заявкою окрім начальника відділу.
                                        <ul><li><strong>Виконати її</strong> - означає що заявку виконали та через деякий час вона потрапить у архів</li>

                                        </ul>
                                    </li>
                                </ul>
                                </p>
                                <p>
                                    Також ви можете залишити коментар до заявки.
                                </p>

                            </div>
                        </div></div>
                    <div class="tab-pane" id="messages"><div class="panel panel-default">
                            <div class="panel-heading">Зміна інформації про працівника</div>
                            <div class="panel-body">
                                <p>Інколи виникає необхідність доповнити інформацію про працівника або змінити її.
                                    Для цього існує розділ - працівники. Знайдіть того працівника, а потім заповніть нові дані. Після чого, вони пройдуть перевірку адміністратором системи і зміняться.
                                </p>
                            </div></div></div>
                </div>
            </div>




        </div>




        <br>



    </div>
    <?php
    include("inc/footer.inc.php");
    ?>

    <?php
    //}
}
else {
    include 'auth.php';
}
?>
